[
  [
    {
      "id": "1",
      "type": "thesis",
      "text": "Man-made climate change can be reversed."
    },
    {
      "id": "1.3",
      "type": "con",
      "text": "Economic forces make reversing climate change extremely challenging."
    },
    {
      "id": "1.3.1",
      "type": "con",
      "text": "Small changes in consumers behavior have a great impact on the actual free market economy and will force big corporation to shift to the new consumers trends"
    },
    {
      "id": "1.3.1.1",
      "type": "pro",
      "text": "Advancements in social networking and business technologies makes it possible for consumers to organize like never before. It can be done on scales above and beyond labour organization, and that can be wielded to pressure corporations and hold them accountable for their effects on the climate. if electronic means of unifying concerned consumers voices is wielded and supported very widely, it will be transformative for global capitalism."
    },
    {
      "id": "1.3.2",
      "type": "pro",
      "text": "Uncontrolled capitalism seems to be pushing us past every threshold scientists calculate."
    },
    {
      "id": "1.3.2.1",
      "type": "con",
      "text": "A capitalist society will still address climate change because environmental investments can make financial sense."
    },
    {
      "id": "1.3.2.1.1",
      "type": "pro",
      "text": "It is possible and all money spent on an energy transition would pay off up to seven times: all new jobs created by the energy transition will significantly outweigh the jobs lost in fossil fuel. It is only a matter of how fast this will be done. Some data here: Decarbonize!"
    },
    {
      "id": "1.3.2.1.1.1",
      "type": "pro",
      "text": "\"Functional\" actions in place will allow relative easy transit: changing the economics of making money from creating pollution towards making money cleaning it. All this can happen by passively shifting the economics system without changing what is in place (i.e. 'cracking' it), but instead creating a new direction as we proceed forward. That will eventually do better than what came before it."
    },
    {
      "id": "1.3.2.1.1.1.1",
      "type": "pro",
      "text": "Financing engineering companies can lead to more jobs while not cracking-up economies by coming up with working solutions at a small and large scale through reducing waste and curving its costs enough to generate a profit."
    },
    {
      "id": "1.3.2.1.1.1.1.1",
      "type": "pro",
      "text": "A good example of the benefits of building on engineering that makes costs reduce and therefore improving profits is renewable power generation (see director's introduction) where now the cost for renewable technologies are dramatically low enough to where it's profitable."
    },
    {
      "id": "1.3.2.2",
      "type": "pro",
      "text": "The capitalistic system creates inefficiencies. Negative effects occur due to this, such as unnecessary: resource use, waste, and pollution."
    },
    {
      "id": "1.3.2.2.1",
      "type": "pro",
      "text": "The supply and demand system makes suppliers guess at what people want instead of actually making what they want. Products get made that should not and products that should be made do not exist, leading to waste and inabilities for people to combat their personal effects on the environment."
    },
    {
      "id": "1.3.2.2.1.1",
      "type": "con",
      "text": "This is not how the supply and demand system works. Entrepreneurs and workers don't \"guess\" what people want, they look at the market's price signal function of money, which signals increases and decreases in supply and demand, and produce more of what is more demanded and less of what is less. They try to offer the market a product, and if people don't want it, they won't buy it, and the company will go bankrupt unless the government bails it out. Companies who doesn't make what they want die."
    },
    {
      "id": "1.3.2.2.1.2",
      "type": "pro",
      "text": "If a company makes a product that no one wants, then that product (along with the resources to make the product) go to waste (with the exception of recycling, repurposing...)"
    },
    {
      "id": "1.3.2.2.2",
      "type": "pro",
      "text": "Advertisements create an interest for items that use unnecessary resources."
    },
    {
      "id": "1.3.2.2.2.1",
      "type": "pro",
      "text": "Products like coffee pods become on trend and they are actually harming to environment, and still people blindly buy them thinking the are convenient."
    },
    {
      "id": "1.3.2.2.3",
      "type": "pro",
      "text": "The disposable economy part of capitalism is especially detrimental, in that it invokes avoidable and preventable behaviors by customers that heavily contribute to pollution and wasting of resources in order to continuously turn a profit."
    },
    {
      "id": "1.3.2.2.3.1",
      "type": "pro",
      "text": "Gillette's business model is based on this concept."
    },
    {
      "id": "1.3.2.2.3.2",
      "type": "pro",
      "text": "Since capitalism fosters a wasteful, resource-heavy process, pollution will continue to overshoot until a more eco-friendly system replaces it."
    },
    {
      "id": "1.3.2.2.3.2.1",
      "type": "pro",
      "text": "Capitalism's wasteful, avoidable behaviors include: 1) buying a new item instead of repairing/replacing bad parts, 2) not reusing, and 3) buying seemingly better products instead of improving what's on-hand. A sustainable economic system where items are bought once and improved when needed would be more eco-friendly."
    }
  ],
  [
    {
      "id": "1",
      "type": "thesis",
      "text": "Man-made climate change can be reversed."
    },
    {
      "id": "1.4",
      "type": "pro",
      "text": "Sustainability efforts show promise for reversing climate change."
    },
    {
      "id": "1.4.1",
      "type": "pro",
      "text": "Wildlife conservation efforts are having a positive impact on climate change."
    },
    {
      "id": "1.4.1.1",
      "type": "con",
      "text": "Biodiversity continues to decline as we further exacerbate the ongoing mass extinction event."
    },
    {
      "id": "1.4.1.2",
      "type": "pro",
      "text": "Expanding their native land through better agricultural practices and restoration methods can encourage population growth."
    },
    {
      "id": "1.4.1.3",
      "type": "pro",
      "text": "Shunning practices that harm endangered populations help (such as the exotic pet market)."
    },
    {
      "id": "1.4.1.4",
      "type": "pro",
      "text": "Donating to organizations/sanctuaries that help wildlife can help."
    },
    {
      "id": "1.4.2",
      "type": "pro",
      "text": "On a small scale, biomimicry shows promise for supporting climate change reversal efforts. The impact would be powerful if applied on a larger scale."
    },
    {
      "id": "1.4.3",
      "type": "pro",
      "text": "According to researchers, repurposing CO2 may reduce carbon emissions to a net zero."
    },
    {
      "id": "1.4.3.1",
      "type": "con",
      "text": "So far, most CO2 repurposing schemes generate more emissions overall."
    },
    {
      "id": "1.4.3.2",
      "type": "pro",
      "text": "For instance, Biochar can be used to sequester unlimited amounts of atmospheric carbon, and it makes good topsoil allowing carbon-neutral desert land to become carbon-negative biochar-producing land, and the \"wood liquor\" extracted from the biomass could be refined into gasoline. Of course, ramping up to the point where biochar sequestration is sequestering thirty gigatonnes a year would require massive, distributed, investment, perhaps unification of humanity towards this purpose."
    },
    {
      "id": "1.4.3.2.1",
      "type": "con",
      "text": "Biochar is not the best idea as it involves burning of matter, which requires energy, could possibly larger problems on a large-scale (where is all the matter going to come from to sustain the practice?), and takes a lot of effort to get started (massive plants because no one has built it on a large-scale)."
    },
    {
      "id": "1.4.3.2.1.1",
      "type": "con",
      "text": "The making of biochar is self feeding because it uses the synthetic gasses that comes off of waste wood as it is being heated in the absence of oxygen. The synthetic gas that is released during the process (called pyrolysis), is highly flammable and provides more than enough heat to perpetuate the process (the extra synthetic gas can be used to generate bio-renewable-electricity). Since the plan is to use waste wood, it makes sustainable use of forest industry biomass waste."
    },
    {
      "id": "1.4.3.2.1.2",
      "type": "pro",
      "text": "Biochar involves the removal of oxygen from the atmosphere, which is the opposite of what the world needs, especially in times of deforestation."
    },
    {
      "id": "1.4.3.2.1.3",
      "type": "pro",
      "text": "A more sustainable effort would be to chip wood and bury it underground, as it uses less resources and steps than biochar."
    },
    {
      "id": "1.4.3.2.1.4",
      "type": "con",
      "text": "Chipping wood and burying it underground has no benefit for soils and can actually be detrimental for plants as it robs nitrogen from soil.   Conversion of waste forest products into biochar for soil enhancement has long term soil benefits, which include drought tolerance.  Carbon captured from the atmosphere through photosynthesis that is buried in this manner is resilient to decomposition and is therefore considered by the UNFCCC as a method of both climate change mitigation and adaptation."
    },
    {
      "id": "1.4.3.2.1.5",
      "type": "con",
      "text": "The making of biochar does not consume oxygen... it is a pyrolysis process that is performed in the absence of or near absence of oxygen and therefor does not involve \"burning\" or results in very little \"burning\" of wood.  Moreover, the introduction of biochar into soils actually increases plant productivity, which contributes to more production of oxygen through the process of photosynthesis.  All good for the planet's atmosphere."
    },
    {
      "id": "1.4.3.2.2",
      "type": "con",
      "text": "Biochar is not necessary if plant matter for it is used instead as ground cover to protect topsoil from losing CO2."
    },
    {
      "id": "1.4.3.2.3",
      "type": "pro",
      "text": "Biochar is an excellent method of carbon sequestration."
    },
    {
      "id": "1.4.3.2.4",
      "type": "con",
      "text": "Biochar could create issues if not done correctly. Proactive measures should be taken to avoid these issues, otherwise biochar efforts may become counterproductive."
    }
  ],
  [
    {
      "id": "1",
      "type": "thesis",
      "text": "Man-made climate change can be reversed."
    },
    {
      "id": "1.5",
      "type": "pro",
      "text": "Technology provides solutions for reversing climate change."
    },
    {
      "id": "1.5.1",
      "type": "con",
      "text": "Technological solutions only work if humans agree to using them. Since many humans resist technological change, our ability to reverse climate change is difficult to gauge."
    },
    {
      "id": "1.5.1.1",
      "type": "pro",
      "text": "Telecommuting is an underplayed, technological advanced option that could curb climate change, if not reverse it. Instead, workers are still forced to actually show up at an office, when it isn't necessary."
    },
    {
      "id": "1.5.1.1.1",
      "type": "pro",
      "text": "Telecommuting is an option that can help, but is ignored by the workforce by forcing employees to work in office when their job can be done remotely. Therefore, even with technological advancements, humans are not taking full advantage of it to reverse climate change."
    },
    {
      "id": "1.5.1.1.2",
      "type": "pro",
      "text": "This is a denial of climate reality by companies who could easily remedy this situation by implementing telecommuting."
    },
    {
      "id": "1.5.2",
      "type": "pro",
      "text": "Humans are making major advancements towards atmospheric modification that suggest we will be able to alter the climate, and thus reverse negative changes."
    },
    {
      "id": "1.5.2.1",
      "type": "pro",
      "text": "Humans are, in fact, quickly learning methods of positively impacting climate for the better. More effort is needed to raise this awareness amongst Earth's near 8 billion humans. Sites AirTerra Canada will have a better chance of accomplishing this."
    },
    {
      "id": "1.5.2.1.1",
      "type": "con",
      "text": "Even if was true that humans are quickly learning methods to potentially reduce their carbon footprint, the extent to which many have to change their lifestyles discourage many from taking the methods into practice."
    },
    {
      "id": "1.5.2.1.1.1",
      "type": "pro",
      "text": "Oil, for instance, is by all denominators the most effective energy resource we have, and it is difficult and will take a long time to try to become independent from it and completely substitute it and other fossil fuels with renewable energy sources."
    },
    {
      "id": "1.5.2.2",
      "type": "con",
      "text": "Though humanity has proven itself capable of utilizing natural resources and controlling how much they take out and how they use these resources, the market's demand for energy cannot be as easily controlled, and this demand restricts how much fossil fuels can be controlled as it's reduction below the demand would lead to economic and political instability. For demand of energy to change, people's lives and habits would need to change, which is very difficult to make people do."
    },
    {
      "id": "1.5.2.2.1",
      "type": "con",
      "text": "Market forces are already at work as solar energy technologies prices fall. Once renewable energy is cheaper than fossil carbon, renewable provision will increase greatly."
    },
    {
      "id": "1.5.2.3",
      "type": "con",
      "text": "The cause of climate change is the combination of the human attempt to control the environment through artifice and the twin explosions of population and improved quality of life; we cannot reverse climate change because we cannot decide to quickly starve everyone of the benefits of industrial production while using the diverted and declining resources to create sustainable systems."
    },
    {
      "id": "1.5.2.4",
      "type": "con",
      "text": "Thus far, humans are not able to modify the atmosphere enough to create significant improvements in the climate."
    },
    {
      "id": "1.5.2.4.1",
      "type": "pro",
      "text": "The process for large scale modification has yet to be proven. Without testing on a larger scale, there is no way to know if these advancements can work."
    },
    {
      "id": "1.5.2.5",
      "type": "con",
      "text": "Because we don't know how exactly man-made climate change started (the more we find out, the more we realize we don't know, as it's long before anyone living on Earth was born, such as with the mammoths) compared to what the baseline temperature was then in proportion to each event, we don't have enough information to make an adequate decision to fix it."
    },
    {
      "id": "1.5.2.5.1",
      "type": "con",
      "text": "In response to a) The evidence is now incontrovertible with regard to \"how exactly climate change happened\", which immediately leads to b) we know very clearly what things to do to slow it down and many things that would reverse the extra CO2 and NH3 in the atmosphere i.e. Limiting the Magnitude of Future Climate Change."
    },
    {
      "id": "1.5.2.5.2",
      "type": "con",
      "text": "Just because we don't know for sure that trees and other long lived plants can solve the problem, we do know for absolute certain that they will absorb lots of the CO2 we've produced, especially if we plant millions and millions of them. That's enough reason to get started doing at least that right now."
    },
    {
      "id": "1.5.2.5.3",
      "type": "con",
      "text": "Not knowing enough is not a justification for inaction. Big interests play this card all the time, let's not buy it."
    },
    {
      "id": "1.5.2.5.4",
      "type": "con",
      "text": "It is possible to get the knowledge needed if we can get to a point where we can work within our means by decreasing the immensity of what's happening (like not contributing to climate change further and also reversing some of the effects that already took place) to where it's close enough to allow for working on a solution."
    }
  ],
  [
    {
      "id": "1",
      "type": "thesis",
      "text": "Man-made climate change can be reversed."
    },
    {
      "id": "1.6",
      "type": "con",
      "text": "Human populations continue to grow exponentially, making it impossible to reverse man-made climate change."
    },
    {
      "id": "1.6.1",
      "type": "con",
      "text": "Population growth is not exponential."
    },
    {
      "id": "1.6.2",
      "type": "con",
      "text": "The world's richest 10% produce 50% of global CO2 emissions and the poorest 50% produce only 10% of emissions. So long as the richest significantly reduce their emissions, to be more in line with the global average, then it'd be possible for global population to grow (for a while longer) without an increase in global emissions."
    },
    {
      "id": "1.6.2.1",
      "type": "con",
      "text": "This is only plausible if the poorest 50% also choose not to increase their consumption/emissions. Since we're already emitting far, far too much, we need a net global reduction every year until global net negative emissions are reached. If developing countries continue to increase their emissions and consumptions; it won't result in a global net reduction even if the top 10% reduce their emissions year/year."
    },
    {
      "id": "1.6.3",
      "type": "con",
      "text": "Without a significant population, humans might not be able to perform such significant technological and large-scale procedures as developing a global climate control system, which in fact went into experimental phase recently in one country."
    },
    {
      "id": "1.6.3.1",
      "type": "con",
      "text": "A truly global climate control system seems way beyond current levels of understanding as well as global coordination that a large population can handle."
    },
    {
      "id": "1.6.3.2",
      "type": "con",
      "text": "It's not the population that is required, but general access to resources and technology. A global control system would greatly benefit from AI and automation technologies."
    },
    {
      "id": "1.6.3.2.1",
      "type": "pro",
      "text": "People need to be replaced, which is difficult to sustain."
    },
    {
      "id": "1.6.3.2.2",
      "type": "pro",
      "text": "People are prone to 'human error', so this would make a climate control system not have that issue."
    },
    {
      "id": "1.6.3.2.3",
      "type": "pro",
      "text": "AI is much cheaper to implement and improve upon."
    },
    {
      "id": "1.6.3.2.4",
      "type": "con",
      "text": "AI may be taken advantage of, as seen in the movie Geostorm."
    },
    {
      "id": "1.6.3.3",
      "type": "con",
      "text": "The number of people is not as necessary as the number of skilled people for developing and managing climate control systems."
    },
    {
      "id": "1.6.3.4",
      "type": "pro",
      "text": "On such a massive scale, it may require people from around the world to monitor it."
    },
    {
      "id": "1.6.4",
      "type": "con",
      "text": "Raising education levels and employment for women can effectively control population."
    },
    {
      "id": "1.6.4.1",
      "type": "pro",
      "text": "-> See 1.2.1."
    },
    {
      "id": "1.6.5",
      "type": "con",
      "text": "Carbon free energy production works no matter how many people use it."
    },
    {
      "id": "1.6.5.1",
      "type": "con",
      "text": "There is currently no carbon free energy; and there are significant resource bottlenecks in building out low-carbon energy to global scales."
    },
    {
      "id": "1.6.5.1.1",
      "type": "con",
      "text": "Resources such as nuclear or large hydroelectric generate no carbon emissions."
    },
    {
      "id": "1.6.5.1.1.1",
      "type": "con",
      "text": "Nuclear power generates around 12 grams of CO2/KWh and hydro electricity is around 24 grams of CO2/KWh."
    }
  ]
]
