{
  "users": [
    {
      "speaker": "OO",
      "description": "this is a telegram user"
    },
    {
      "speaker": "OG",
      "description": "this is a telegram user"
    },
    {
      "speaker": "CG",
      "description": "this is a telegram user"
    },
    {
      "speaker": "CO",
      "description": "this is a telegram user"
    }
  ],
  "tree": {
    "id": "1",
    "speaker": "OO",
    "text": "Green technology needed to fully eliminate carbon footprint likely does not yet exist.",
    "children": [
      {
        "id": "1.1",
        "speaker": "OG",
        "text": "Monetary policy can funnel capital quickly into green businesses, incentivizing faster development.",
        "children": [
          {
            "id": "1.1.1",
            "speaker": "CG",
            "text": "Central bank policy reduces fossil fuel industry viability, enhancing green tech growth potential.",
            "children": [
              {
                "id": "1.1.1.1",
                "speaker": "CO",
                "text": "Companies will aggressively downsize and harm vulnerable workers during restructuring.",
                "children": [
                  {
                    "id": "1.1.1.1.2",
                    "speaker": "OO",
                    "text": "Economic harm from rapid divestment outweighs speculative long-term green benefits.",
                    "children": []
                  }
                ]
              },
              {
                "id": "1.1.1.2",
                "speaker": "OG",
                "text": "Big polluters have money and patents but stall green tech for profit motives; central bank incentives align private and social interests.",
                "children": [
                  {
                    "id": "1.1.1.2.2",
                    "speaker": "CG",
                    "text": "Angel investors prefer tech and pharma with higher returns over speculative green tech.",
                    "children": []
                  },
                  {
                    "id": "1.1.1.2.3",
                    "speaker": "OO",
                    "text": "Polluting industries can't diversify quickly due to costs, resource dependence, and lack of R&D.",
                    "children": []
                  }
                ]
              },
              {
                "id": "1.1.1.3",
                "speaker": "OO",
                "text": "Developing nations rely on polluting industries for economic growth; cutting investment leads to economic collapse and poverty.",
                "children": [
                  {
                    "id": "1.1.1.3.1",
                    "speaker": "OG",
                    "text": "Client relationships and regulation prevent companies from simply switching banks to avoid green mandates.",
                    "children": []
                  },
                  {
                    "id": "1.1.1.3.2",
                    "speaker": "CO",
                    "text": "Inflation disproportionately harms the poor and vulnerable, outweighing speculative green investment benefits.",
                    "children": []
                  },
                  {
                    "id": "1.1.1.3.3",
                    "speaker": "CG",
                    "text": "Developing world can develop without natural resources; central bank policy avoids propping up exploitative industries.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": "1.1.2",
            "speaker": "OO",
            "text": "Green tech investments are already attractive; new central bank policy mainly diverts funds to neutral, low-profit sectors.",
            "children": [
              {
                "id": "1.1.2.1",
                "speaker": "CG",
                "text": "Central bank action solves collective action problem and ensures sustainable jobs for future generations.",
                "children": [
                  {
                    "id": "1.1.2.1.1",
                    "speaker": "OG",
                    "text": "Central banks act independently and without political lobbying, unlike governments.",
                    "children": []
                  },
                  {
                    "id": "1.1.2.1.2",
                    "speaker": "CO",
                    "text": "Central bank climate action reduces political will for broader climate policies by creating complacency.",
                    "children": []
                  },
                  {
                    "id": "1.1.2.1.3",
                    "speaker": "OO",
                    "text": "No alternative investments exist in developing countries, risking long-term economic and environmental harm.",
                    "children": []
                  }
                ]
              },
              {
                "id": "1.1.2.2",
                "speaker": "OG",
                "text": "OO contradict themselves by claiming green investment is already high but also causing unemployment harm.",
                "children": [
                  {
                    "id": "1.1.2.2.2",
                    "speaker": "CO",
                    "text": "Inflation and economic instability primarily harm the most vulnerable by reducing purchasing power and control.",
                    "children": []
                  }
                ]
              },
              {
                "id": "1.1.2.3",
                "speaker": "CO",
                "text": "Economic harms to workers and inflation outweigh speculative climate benefits; economic stability must be prioritized.",
                "children": [
                  {
                    "id": "1.1.2.3.1",
                    "speaker": "OO",
                    "text": "Many polluting industries remain dependent on fossil fuels due to colonial legacies and resource advantages.",
                    "children": []
                  },
                  {
                    "id": "1.1.2.3.3",
                    "speaker": "CG",
                    "text": "Government intervention is limited and less effective without central bank support.",
                    "children": []
                  }
                ]
              }
            ]
          },
          {
            "id": "1.1.3",
            "speaker": "CO",
            "text": "Monetary policy is slow, indirect, and limited in effectiveness compared to political/regulatory action.",
            "children": [
              {
                "id": "1.1.3.1",
                "speaker": "OO",
                "text": "Central bank policies cutting favorable rates to polluting industries cause immediate job losses and economic shocks.",
                "children": []
              },
              {
                "id": "1.1.3.2",
                "speaker": "OG",
                "text": "Central banks have historically shifted priorities and can shift to support green policies without huge disruption.",
                "children": [
                  {
                    "id": "1.1.3.2.1",
                    "speaker": "CO",
                    "text": "Central bank green policies politicize climate action, reducing public support and political will.",
                    "children": []
                  }
                ]
              },
              {
                "id": "1.1.3.3",
                "speaker": "CG",
                "text": "Political action is blocked by lobbying and partisan opposition, making central bank intervention necessary.",
                "children": [
                  {
                    "id": "1.1.3.3.1",
                    "speaker": "OG",
                    "text": "Climate disaster is urgent with worsening impacts and slow government action.",
                    "children": []
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "id": "1.3",
        "speaker": "CG",
        "text": "Private sector unwilling to invest significantly in green tech due to high startup costs and risks.",
        "children": [
          {
            "id": "1.3.1",
            "speaker": "OO",
            "text": "Private actors, not governments, are the main investors in green tech due to growth potential and lowered entry costs.",
            "children": [
              {
                "id": "1.3.1.1",
                "speaker": "CO",
                "text": "Large economic restructuring causes inflation and market shifts, contradicting OG’s claim that expert investors prevent this.",
                "children": []
              },
              {
                "id": "1.3.1.2",
                "speaker": "CG",
                "text": "Angel and venture investors are financial illiterate on green tech due to risks and short-term focus.",
                "children": []
              },
              {
                "id": "1.3.1.3",
                "speaker": "OG",
                "text": "Central bank policy changes cost of borrowing, directly pressuring companies to shift business models.",
                "children": []
              }
            ]
          },
          {
            "id": "1.3.2",
            "speaker": "OG",
            "text": "Green investments are attractive to private equity and pension funds when supported by central bank policies.",
            "children": [
              {
                "id": "1.3.2.1",
                "speaker": "CO",
                "text": "Inflation control and market stability are central bank priorities and will be harmed by green mandates.",
                "children": []
              },
              {
                "id": "1.3.2.2",
                "speaker": "OO",
                "text": "Rapid divestment leads to job losses, reduced infrastructure development, and less food security in vulnerable countries.",
                "children": []
              },
              {
                "id": "1.3.2.3",
                "speaker": "CG",
                "text": "Private sector collusion with fossil fuels prevents structural change without central bank mandates.",
                "children": []
              }
            ]
          },
          {
            "id": "1.3.3",
            "speaker": "CO",
            "text": "Companies will cut costs and abuse workers rather than transition to green technology due to restructuring costs and uncertainty.",
            "children": [
              {
                "id": "1.3.3.1",
                "speaker": "CG",
                "text": "Negative interest rates are viable and central banks have significant market influence.",
                "children": []
              },
              {
                "id": "1.3.3.3",
                "speaker": "OG",
                "text": "Green central banking creates jobs, aids developing countries, and aligns economic and environmental goals.",
                "children": []
              }
            ]
          }
        ]
      }
    ]
  }
}